first_routes/app/controllers/artworks_controller.rb

def index
    artwork = Artwork.all
---
SELECT "artworks".* FROM "artworks"

def update
    artwork = Artwork.find(params[:id])
    if artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "artist_id" = $3, "updated_at" = $4 WHERE "artworks"."id" = $5  [["title", "newpainting"], ["image_url", "www.newpainting.com"], ["artist_id", 3], ["updated_at", "2021-04-01 19:04:32.604054"], ["id", 2]]